# <center> Week 2: Data Preparation </center>

## Learning Objectives 

* What is data preparation? 
* How we can prepare data in Python?

[For online lab click here](https://mybinder.org/v2/gh/jupyterlab/jupyterlab-demo/master?urlpath=lab/tree/demo/Lorenz.ipynb)

## 1- Importing data


![dataloading](Figs/DataImport.PNG)

#### 1- From files [(To learn more, click here)](https://www.py4e.com/lessons/files)
#### 2- From database [(To learn more, click here)](https://www.py4e.com/lessons/json)
#### 3- From Internet [(To learn more, click here).](https://www.py4e.com/lessons/servces) For more datasets [(Click here)](https://archive.ics.uci.edu/ml/datasets.html)

### Reading CSV files:

In [1]:
import pandas as pd
import numpy as np

DFf=pd.read_table('C:\\Users\\Esmal\\Desktop\\bigdata\\data\\Adult.data',sep=',')

DFw=pd.read_table('https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data', sep=',')

In [2]:
DFf.head(5)

,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
0,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
1,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
2,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
3,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
4,37,Private,284582,Masters,14,Married-civ-spouse,Exec-managerial,Wife,White,Female,0,0,40,United-States,<=50K

**Add header to the dataframe**

- 1- Specify that there is no header in the original link by: **header=None**.

- 2- Specify column names with a list of strings **(names=YourLIST)**.

In [3]:

HeadNames=['age', 'workclass', 'fnlwg', 'education', 'education-num', 'marital-status', 'occupation', 'relationship', 
           'race', 'sex','capital-gain', 'capital-loss', 'hours-per-week', 'native-country', 'income' ]


DFw=pd.read_table('https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data', sep=',', header=None, names=HeadNames)


DFw.head()

,age,workclass,fnlwg,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,income
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [4]:
DFw.shape

(32561, 15)

In [5]:
DFw.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 15 columns):
age               32561 non-null int64
workclass         32561 non-null object
fnlwg             32561 non-null int64
education         32561 non-null object
education-num     32561 non-null int64
marital-status    32561 non-null object
occupation        32561 non-null object
relationship      32561 non-null object
race              32561 non-null object
sex               32561 non-null object
capital-gain      32561 non-null int64
capital-loss      32561 non-null int64
hours-per-week    32561 non-null int64
native-country    32561 non-null object
income            32561 non-null object
dtypes: int64(6), object(9)
memory usage: 3.7+ MB

In [6]:
DFw.isnull().sum()

age               0
workclass         0
fnlwg             0
education         0
education-num     0
marital-status    0
occupation        0
relationship      0
race              0
sex               0
capital-gain      0
capital-loss      0
hours-per-week    0
native-country    0
income            0
dtype: int64

In [7]:
DFw.describe()

,age,fnlwg,education-num,capital-gain,capital-loss,hours-per-week
count,32561.000000,3.256100e+04,32561.000000,32561.000000,32561.000000,32561.000000
mean,38.581647,1.897784e+05,10.080679,1077.648844,87.303830,40.437456
std,13.640433,1.055500e+05,2.572720,7385.292085,402.960219,12.347429
min,17.000000,1.228500e+04,1.000000,0.000000,0.000000,1.000000
25%,28.000000,1.178270e+05,9.000000,0.000000,0.000000,40.000000
50%,37.000000,1.783560e+05,10.000000,0.000000,0.000000,40.000000
75%,48.000000,2.370510e+05,12.000000,0.000000,0.000000,45.000000
max,90.000000,1.484705e+06,16.000000,99999.000000,4356.000000,99.000000

## 2- Adding, dropping columns

**Add 1 to all rows of new column called 'Big Data'**

In [8]:
DFw['Big Data']=1

In [9]:
DFw.head()

,age,workclass,fnlwg,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,income,Big Data
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K,1
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K,1
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K,1
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K,1
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K,1

**Drop columns 'Big Data' and 'capital-loss'**

In [10]:
DFw.columns

Index(['age', 'workclass', 'fnlwg', 'education', 'education-num',
       'marital-status', 'occupation', 'relationship', 'race', 'sex',
       'capital-gain', 'capital-loss', 'hours-per-week', 'native-country',
       'income', 'Big Data'],
      dtype='object')

In [11]:
DFw2=DFw.drop(['capital-loss','Big Data'], axis=1)

Which columns do we have now? Why?

**Drop 3rd and 4th row**

In [12]:
DFw3=DFw2.drop([2,3],axis=0)

Which rows do we have now? Why?

**Drop missing values** [[Ref.]](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.dropna.html)

### Filtering rows based on conditions

**General format: df[ (condition1) * (condition2) ...]**

**Example:** Create a new dataframe that only contains females older than 40 years old.

In [13]:
DFw3['sex'].value_counts()

 Male      21788
 Female    10771
Name: sex, dtype: int64

In [14]:
#Remove white space in dataframe

DFw3.replace(' ', '', inplace=True)    # What happens if we don't remove the white space?

In [15]:
DFw3[(DFw3['sex']=='Female') & (DFw3['age']>40)]    ## use DFw3['sex'][0] to make sure that

Empty DataFrame
Columns: [age, workclass, fnlwg, education, education-num, marital-status, occupation, relationship, race, sex, capital-gain, hours-per-week, native-country, income]
Index: []

**Example:** Which "workclass" makes more than 50k?

In [16]:
DFw3[DFw3['income']== ">50K"].workclass.value_counts()  #Other usefull inputs to value_counts:  normalize=True, dropna=False

Series([], Name: workclass, dtype: int64)

**Groupby():**

In [17]:
DFw3.groupby('income').workclass.value_counts()

income  workclass
 <=50K   Private             17731
         Self-emp-not-inc     1817
         ?                    1645
         Local-gov            1476
         State-gov             945
         Federal-gov           589
         Self-emp-inc          494
         Without-pay            14
         Never-worked            7
 >50K    Private              4963
         Self-emp-not-inc      724
         Self-emp-inc          622
         Local-gov             617
         Federal-gov           371
         State-gov             353
         ?                     191
Name: workclass, dtype: int64

**Does gender efect the income level?**

In [18]:
DFw3.groupby('sex').income.value_counts(normalize=True)

sex      income
 Female   <=50K    0.890539
          >50K     0.109461
 Male     <=50K    0.694235
          >50K     0.305765
Name: income, dtype: float64

## 3- Dealing with Time in pandas

In [19]:
# Load the household power consumption dataset

EN=pd.read_table('C:\\Users\\Esmal\\Desktop\\bigdata\\data\\Police.csv', sep=',')

EN.head()

,stop_date,stop_time,county_name,driver_gender,driver_age_raw,driver_age,driver_race,violation_raw,violation,search_conducted,search_type,stop_outcome,is_arrested,stop_duration,drugs_related_stop
0,2005-01-02,01:55,NaN,M,1985.0,20.0,White,Speeding,Speeding,False,NaN,Citation,False,0-15 Min,False
1,2005-01-18,08:15,NaN,M,1965.0,40.0,White,Speeding,Speeding,False,NaN,Citation,False,0-15 Min,False
2,2005-01-23,23:15,NaN,M,1972.0,33.0,White,Speeding,Speeding,False,NaN,Citation,False,0-15 Min,False
3,2005-02-20,17:15,NaN,M,1986.0,19.0,White,Call for Service,Other,False,NaN,Arrest Driver,True,16-30 Min,False
4,2005-03-14,10:00,NaN,F,1984.0,21.0,White,Speeding,Speeding,False,NaN,Citation,False,0-15 Min,False

In [281]:
EN['TIME']=pd.to_datetime(EN['stop_date'])

EN.dtypes

stop_date                     object
stop_time                     object
county_name                  float64
driver_gender                 object
driver_age_raw               float64
driver_age                   float64
driver_race                   object
violation_raw                 object
violation                     object
search_conducted                bool
search_type                   object
stop_outcome                  object
is_arrested                   object
stop_duration                 object
drugs_related_stop              bool
TIME                  datetime64[ns]
dtype: object

In [286]:
EN['TIME'].dt.year.value_counts()

2012    10970
2006    10639
2007     9476
2014     9228
2008     8752
2015     8599
2011     8126
2013     7924
2009     7908
2010     7561
2005     2558
Name: TIME, dtype: int64

## Data Visualization

![pairplot](Figs/seaborn_pairplot-1.png)

* pd.df.Value_counts()
* pd.df.describe()
* pd.df.info()

## Data Cleaning:

![DataCleaning](Figs/DataCleaning.PNG)

* Checking data format
* Handling missing data
* Removing anomalies